// ******* Завдання 4. Перевірка права на страхування *******

// Константа для назви страхової компанії:
const COMPANY_NAME = "A";

// Задаємо користувачеві питання з відповіддю так/ні, і зберігаємо результати у змінних:
let isFromUkraine = confirm("Ти з України?");
let isOver21 = confirm("Тобі більше 21?");
let hasHigherEducation = confirm("Ти маєш вищу освіту?");
let hasSecondCar = confirm("В тебе є друге авто?");
let hasChildren = confirm("В тебе є діти?");
let hasDTP = confirm("Чи були в тебе ДТП?");
let hasLetterAInName = confirm("Чи є у твоєму імені літера 'А'?");

// (примітка):  Оператори && і || підтримують скорочене обчислення: 
// якщо першого операнда достатньо визначення результату, другий операнд не оцінюється.
// Так, якщо перший операнд логічного І(&&) еквівалентний значенню false, то другий операнд не оцінюється.
// У випадку з логічним АБО(||) навпаки, правий операнд не оцінюється, якщо лівий еквівалентний значенню true.

// Визначаємо відповідність вимогам на основі відповідей користувача та правил страхової компанії:
let decision = (
  hasLetterAInName || // Якщо ім'я містить літеру "A", 
  // користувач отримує страховку, незалежно від інших умов - скорочене обчислення з логічним АБО
  // АБО
  (isFromUkraine && // Користувач повинен бути з України
    //  І
    (!hasDTP || // не мав ДТП 
      // АБО
      (hasDTP && isOver21 && hasChildren && hasHigherEducation)
      // допускається наявність ДТП, але повинні бути дотримані і інші 3 умови
    )
  )
);

// Об'єднюємо всі відповіді:
let answers = `isFromUkraine - ${isFromUkraine},
\nisOver21 - ${isOver21},
\nhasHigherEducation - ${hasHigherEducation},
\nhasChildren - ${hasChildren},
\nhasDTP - ${hasDTP},
\nhasLetterAInName - ${hasLetterAInName}`;

// Відображаємо остаточне рішення користувачеві
alert(`${answers}\nСтатус рішення - ${decision}. З повагою, страхова компанія ${COMPANY_NAME}`);